Revit 2024 API
ProjectBrowserDataChangedEventArgs Properties
The ProjectBrowserDataChangedEventArgs type exposes the following members.
Properties
Name | Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from RevitAPIEventArgs.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RevitAPIEventArgs.)
See Also
ProjectBrowserDataChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace